
## UCF output
set_property PACKAGE_PIN J32 [get_ports {FB1_RX_LVDS_N[0]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[0]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[0]}]
set_property PACKAGE_PIN E28 [get_ports {FB1_RX_LVDS_N[1]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[1]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[1]}]
set_property PACKAGE_PIN R33 [get_ports {FB1_RX_LVDS_N[2]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[2]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[2]}]
set_property PACKAGE_PIN M32 [get_ports {FB1_RX_LVDS_N[3]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[3]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[3]}]
set_property PACKAGE_PIN E29 [get_ports {FB1_RX_LVDS_N[4]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[4]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[4]}]
set_property PACKAGE_PIN K31 [get_ports {FB1_RX_LVDS_N[5]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[5]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[5]}]
set_property PACKAGE_PIN B32 [get_ports {FB1_RX_LVDS_N[6]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[6]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[6]}]
set_property PACKAGE_PIN M30 [get_ports {FB1_RX_LVDS_N[7]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[7]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[7]}]
set_property PACKAGE_PIN F31 [get_ports {FB1_RX_LVDS_N[8]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[8]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[8]}]
set_property PACKAGE_PIN M33 [get_ports {FB1_RX_LVDS_N[9]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[9]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[9]}]
set_property PACKAGE_PIN A33 [get_ports {FB1_RX_LVDS_N[10]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[10]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[10]}]
set_property PACKAGE_PIN J31 [get_ports {FB1_RX_LVDS_N[11]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[11]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[11]}]
set_property PACKAGE_PIN U33 [get_ports {FB1_RX_LVDS_N[12]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[12]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[12]}]
set_property PACKAGE_PIN T30 [get_ports {FB1_RX_LVDS_N[13]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[13]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[13]}]
set_property PACKAGE_PIN D32 [get_ports {FB1_RX_LVDS_N[14]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[14]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[14]}]
set_property PACKAGE_PIN P30 [get_ports {FB1_RX_LVDS_N[15]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[15]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[15]}]
set_property PACKAGE_PIN B30 [get_ports {FB1_RX_LVDS_N[16]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[16]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[16]}]
set_property PACKAGE_PIN T29 [get_ports {FB1_RX_LVDS_N[17]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[17]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[17]}]
set_property PACKAGE_PIN P32 [get_ports {FB1_RX_LVDS_N[18]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[18]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[18]}]
set_property PACKAGE_PIN N32 [get_ports {FB1_RX_LVDS_N[19]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[19]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[19]}]
set_property PACKAGE_PIN R31 [get_ports {FB1_RX_LVDS_N[20]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[20]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[20]}]
set_property PACKAGE_PIN A29 [get_ports {FB1_RX_LVDS_N[21]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[21]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[21]}]
set_property PACKAGE_PIN D31 [get_ports {FB1_RX_LVDS_N[22]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[22]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[22]}]
set_property PACKAGE_PIN L29 [get_ports {FB1_RX_LVDS_N[23]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_P[23]}]
set_property IOSTANDARD LVDS [get_ports {FB1_RX_LVDS_N[23]}]
set_property PACKAGE_PIN H29 [get_ports FB1_CLK0_N]
set_property PACKAGE_PIN J27 [get_ports FB1_CLK1_N]
set_property IOSTANDARD LVDS [get_ports FB1_CLK0_P]
set_property IOSTANDARD LVDS [get_ports FB1_CLK0_N]
set_property IOSTANDARD LVDS [get_ports FB1_CLK1_P]
set_property IOSTANDARD LVDS [get_ports FB1_CLK1_N]
set_property PACKAGE_PIN K24 [get_ports {FB2_RX_LVDS_N[0]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[0]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[0]}]
set_property PACKAGE_PIN F25 [get_ports {FB2_RX_LVDS_N[1]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[1]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[1]}]
set_property PACKAGE_PIN U28 [get_ports {FB2_RX_LVDS_N[2]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[2]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[2]}]
set_property PACKAGE_PIN J26 [get_ports {FB2_RX_LVDS_N[3]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[3]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[3]}]
set_property PACKAGE_PIN L23 [get_ports {FB2_RX_LVDS_N[4]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[4]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[4]}]
set_property PACKAGE_PIN H25 [get_ports {FB2_RX_LVDS_N[5]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[5]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[5]}]
set_property PACKAGE_PIN N24 [get_ports {FB2_RX_LVDS_N[6]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[6]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[6]}]
set_property PACKAGE_PIN R24 [get_ports {FB2_RX_LVDS_N[7]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[7]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[7]}]
set_property PACKAGE_PIN P27 [get_ports {FB2_RX_LVDS_N[8]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[8]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[8]}]
set_property PACKAGE_PIN E24 [get_ports {FB2_RX_LVDS_N[9]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[9]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[9]}]
set_property PACKAGE_PIN G26 [get_ports {FB2_RX_LVDS_N[10]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[10]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[10]}]
set_property PACKAGE_PIN A26 [get_ports {FB2_RX_LVDS_N[11]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[11]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[11]}]
set_property PACKAGE_PIN N29 [get_ports {FB2_RX_LVDS_N[12]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[12]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[12]}]
set_property PACKAGE_PIN C24 [get_ports {FB2_RX_LVDS_N[13]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[13]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[13]}]
set_property PACKAGE_PIN E26 [get_ports {FB2_RX_LVDS_N[14]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[14]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[14]}]
set_property PACKAGE_PIN M25 [get_ports {FB2_RX_LVDS_N[15]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[15]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[15]}]
set_property PACKAGE_PIN P26 [get_ports {FB2_RX_LVDS_N[16]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[16]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[16]}]
set_property PACKAGE_PIN R26 [get_ports {FB2_RX_LVDS_N[17]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[17]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[17]}]
set_property PACKAGE_PIN R29 [get_ports {FB2_RX_LVDS_N[18]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[18]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[18]}]
set_property PACKAGE_PIN K26 [get_ports {FB2_RX_LVDS_N[19]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[19]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[19]}]
set_property PACKAGE_PIN L25 [get_ports {FB2_RX_LVDS_N[20]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[20]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[20]}]
set_property PACKAGE_PIN A23 [get_ports {FB2_RX_LVDS_N[21]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[21]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[21]}]
set_property PACKAGE_PIN B25 [get_ports {FB2_RX_LVDS_N[22]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[22]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[22]}]
set_property PACKAGE_PIN B27 [get_ports {FB2_RX_LVDS_N[23]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_P[23]}]
set_property IOSTANDARD LVDS [get_ports {FB2_RX_LVDS_N[23]}]
set_property PACKAGE_PIN H33 [get_ports FB2_CLK0_N]
set_property PACKAGE_PIN G30 [get_ports FB2_CLK1_N]
set_property IOSTANDARD LVDS [get_ports FB2_CLK0_P]
set_property IOSTANDARD LVDS [get_ports FB2_CLK0_N]
set_property IOSTANDARD LVDS [get_ports FB2_CLK1_P]
set_property IOSTANDARD LVDS [get_ports FB2_CLK1_N]
set_property PACKAGE_PIN J22 [get_ports {FB3_RX_LVDS_N[0]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[0]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[0]}]
set_property PACKAGE_PIN E18 [get_ports {FB3_RX_LVDS_N[1]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[1]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[1]}]
set_property PACKAGE_PIN G20 [get_ports {FB3_RX_LVDS_N[2]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[2]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[2]}]
set_property PACKAGE_PIN F19 [get_ports {FB3_RX_LVDS_N[3]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[3]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[3]}]
set_property PACKAGE_PIN F21 [get_ports {FB3_RX_LVDS_N[4]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[4]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[4]}]
set_property PACKAGE_PIN H19 [get_ports {FB3_RX_LVDS_N[5]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[5]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[5]}]
set_property PACKAGE_PIN A18 [get_ports {FB3_RX_LVDS_N[6]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[6]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[6]}]
set_property PACKAGE_PIN P22 [get_ports {FB3_RX_LVDS_N[7]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[7]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[7]}]
set_property PACKAGE_PIN E21 [get_ports {FB3_RX_LVDS_N[8]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[8]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[8]}]
set_property PACKAGE_PIN D21 [get_ports {FB3_RX_LVDS_N[9]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[9]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[9]}]
set_property PACKAGE_PIN A21 [get_ports {FB3_RX_LVDS_N[10]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[10]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[10]}]
set_property PACKAGE_PIN A20 [get_ports {FB3_RX_LVDS_N[11]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[11]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[11]}]
set_property PACKAGE_PIN R21 [get_ports {FB3_RX_LVDS_N[12]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[12]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[12]}]
set_property PACKAGE_PIN F18 [get_ports {FB3_RX_LVDS_N[13]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[13]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[13]}]
set_property PACKAGE_PIN K21 [get_ports {FB3_RX_LVDS_N[14]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[14]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[14]}]
set_property PACKAGE_PIN N17 [get_ports {FB3_RX_LVDS_N[15]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[15]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[15]}]
set_property PACKAGE_PIN T20 [get_ports {FB3_RX_LVDS_N[16]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[16]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[16]}]
set_property PACKAGE_PIN L18 [get_ports {FB3_RX_LVDS_N[17]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[17]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[17]}]
set_property PACKAGE_PIN R19 [get_ports {FB3_RX_LVDS_N[18]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[18]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[18]}]
set_property PACKAGE_PIN T18 [get_ports {FB3_RX_LVDS_N[19]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[19]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[19]}]
set_property PACKAGE_PIN U16 [get_ports {FB3_RX_LVDS_N[20]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[20]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[20]}]
set_property PACKAGE_PIN N19 [get_ports {FB3_RX_LVDS_N[21]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[21]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[21]}]
set_property PACKAGE_PIN P20 [get_ports {FB3_RX_LVDS_N[22]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[22]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[22]}]
set_property PACKAGE_PIN K19 [get_ports {FB3_RX_LVDS_N[23]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_P[23]}]
set_property IOSTANDARD LVDS [get_ports {FB3_RX_LVDS_N[23]}]
set_property PACKAGE_PIN H14 [get_ports FB3_CLK0_N]
set_property PACKAGE_PIN J14 [get_ports FB3_CLK1_N]
set_property IOSTANDARD LVDS [get_ports FB3_CLK0_P]
set_property IOSTANDARD LVDS [get_ports FB3_CLK0_N]
set_property IOSTANDARD LVDS [get_ports FB3_CLK1_P]
set_property IOSTANDARD LVDS [get_ports FB3_CLK1_N]
set_property PACKAGE_PIN D12 [get_ports {FB4_RX_LVDS_N[0]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[0]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[0]}]
set_property PACKAGE_PIN C12 [get_ports {FB4_RX_LVDS_N[1]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[1]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[1]}]
set_property PACKAGE_PIN F16 [get_ports {FB4_RX_LVDS_N[2]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[2]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[2]}]
set_property PACKAGE_PIN F13 [get_ports {FB4_RX_LVDS_N[3]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[3]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[3]}]
set_property PACKAGE_PIN F15 [get_ports {FB4_RX_LVDS_N[4]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[4]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[4]}]
set_property PACKAGE_PIN G13 [get_ports {FB4_RX_LVDS_N[5]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[5]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[5]}]
set_property PACKAGE_PIN B12 [get_ports {FB4_RX_LVDS_N[6]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[6]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[6]}]
set_property PACKAGE_PIN R13 [get_ports {FB4_RX_LVDS_N[7]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[7]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[7]}]
set_property PACKAGE_PIN B17 [get_ports {FB4_RX_LVDS_N[8]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[8]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[8]}]
set_property PACKAGE_PIN D14 [get_ports {FB4_RX_LVDS_N[9]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[9]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[9]}]
set_property PACKAGE_PIN A15 [get_ports {FB4_RX_LVDS_N[10]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[10]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[10]}]
set_property PACKAGE_PIN A13 [get_ports {FB4_RX_LVDS_N[11]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[11]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[11]}]
set_property PACKAGE_PIN M12 [get_ports {FB4_RX_LVDS_N[12]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[12]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[12]}]
set_property PACKAGE_PIN L14 [get_ports {FB4_RX_LVDS_N[13]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[13]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[13]}]
set_property PACKAGE_PIN L13 [get_ports {FB4_RX_LVDS_N[14]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[14]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[14]}]
set_property PACKAGE_PIN P14 [get_ports {FB4_RX_LVDS_N[15]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[15]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[15]}]
set_property PACKAGE_PIN P16 [get_ports {FB4_RX_LVDS_N[16]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[16]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[16]}]
set_property PACKAGE_PIN N13 [get_ports {FB4_RX_LVDS_N[17]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[17]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[17]}]
set_property PACKAGE_PIN P12 [get_ports {FB4_RX_LVDS_N[18]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[18]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[18]}]
set_property PACKAGE_PIN U15 [get_ports {FB4_RX_LVDS_N[19]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[19]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[19]}]
set_property PACKAGE_PIN N15 [get_ports {FB4_RX_LVDS_N[20]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[20]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[20]}]
set_property PACKAGE_PIN T15 [get_ports {FB4_RX_LVDS_N[21]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[21]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[21]}]
set_property PACKAGE_PIN J12 [get_ports {FB4_RX_LVDS_N[22]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[22]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[22]}]
set_property PACKAGE_PIN R17 [get_ports {FB4_RX_LVDS_N[23]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_P[23]}]
set_property IOSTANDARD LVDS [get_ports {FB4_RX_LVDS_N[23]}]
set_property PACKAGE_PIN G17 [get_ports FB4_CLK0_N]
set_property PACKAGE_PIN J16 [get_ports FB4_CLK1_N]
set_property IOSTANDARD LVDS [get_ports FB4_CLK0_P]
set_property IOSTANDARD LVDS [get_ports FB4_CLK0_N]
set_property IOSTANDARD LVDS [get_ports FB4_CLK1_P]
set_property IOSTANDARD LVDS [get_ports FB4_CLK1_N]
set_property PACKAGE_PIN C29 [get_ports {FB1_TX_LVDS_N[0]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_P[0]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_N[0]}]
set_property PACKAGE_PIN F33 [get_ports {FB1_TX_LVDS_N[1]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_P[1]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_N[1]}]
set_property PACKAGE_PIN E33 [get_ports {FB1_TX_LVDS_N[2]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_P[2]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_N[2]}]
set_property PACKAGE_PIN C33 [get_ports {FB1_TX_LVDS_N[3]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_P[3]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_N[3]}]
set_property PACKAGE_PIN A31 [get_ports {FB1_TX_LVDS_N[4]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_P[4]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_N[4]}]
set_property PACKAGE_PIN K29 [get_ports {FB1_TX_LVDS_N[5]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_P[5]}]
set_property IOSTANDARD LVDS [get_ports {FB1_TX_LVDS_N[5]}]
set_property PACKAGE_PIN J29 [get_ports FB1_TX_FWD_CLK_N]
set_property IOSTANDARD LVDS [get_ports FB1_TX_FWD_CLK_P]
set_property IOSTANDARD LVDS [get_ports FB1_TX_FWD_CLK_N]
set_property PACKAGE_PIN K33 [get_ports FB1_SOFT_RESET0_N]
set_property IOSTANDARD LVDS [get_ports FB1_SOFT_RESET0_P]
set_property IOSTANDARD LVDS [get_ports FB1_SOFT_RESET0_N]
set_property PACKAGE_PIN G27 [get_ports FB1_SOFT_RESET1_N]
set_property IOSTANDARD LVDS [get_ports FB1_SOFT_RESET1_P]
set_property IOSTANDARD LVDS [get_ports FB1_SOFT_RESET1_N]
set_property PACKAGE_PIN H24 [get_ports {FB2_TX_LVDS_N[0]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_P[0]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_N[0]}]
set_property PACKAGE_PIN F28 [get_ports {FB2_TX_LVDS_N[1]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_P[1]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_N[1]}]
set_property PACKAGE_PIN T25 [get_ports {FB2_TX_LVDS_N[2]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_P[2]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_N[2]}]
set_property PACKAGE_PIN B28 [get_ports {FB2_TX_LVDS_N[3]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_P[3]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_N[3]}]
set_property PACKAGE_PIN A25 [get_ports {FB2_TX_LVDS_N[4]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_P[4]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_N[4]}]
set_property PACKAGE_PIN T23 [get_ports {FB2_TX_LVDS_N[5]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_P[5]}]
set_property IOSTANDARD LVDS [get_ports {FB2_TX_LVDS_N[5]}]
set_property PACKAGE_PIN U26 [get_ports FB2_TX_FWD_CLK_N]
set_property IOSTANDARD LVDS [get_ports FB2_TX_FWD_CLK_P]
set_property IOSTANDARD LVDS [get_ports FB2_TX_FWD_CLK_N]
set_property PACKAGE_PIN F23 [get_ports FB2_SOFT_RESET0_N]
set_property IOSTANDARD LVDS [get_ports FB2_SOFT_RESET0_P]
set_property IOSTANDARD LVDS [get_ports FB2_SOFT_RESET0_N]
set_property PACKAGE_PIN D27 [get_ports FB2_SOFT_RESET1_N]
set_property IOSTANDARD LVDS [get_ports FB2_SOFT_RESET1_P]
set_property IOSTANDARD LVDS [get_ports FB2_SOFT_RESET1_N]
set_property PACKAGE_PIN C19 [get_ports {FB3_TX_LVDS_N[0]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_P[0]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_N[0]}]
set_property PACKAGE_PIN G22 [get_ports {FB3_TX_LVDS_N[1]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_P[1]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_N[1]}]
set_property PACKAGE_PIN M22 [get_ports {FB3_TX_LVDS_N[2]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_P[2]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_N[2]}]
set_property PACKAGE_PIN L20 [get_ports {FB3_TX_LVDS_N[3]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_P[3]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_N[3]}]
set_property PACKAGE_PIN A16 [get_ports {FB3_TX_LVDS_N[4]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_P[4]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_N[4]}]
set_property PACKAGE_PIN E16 [get_ports {FB3_TX_LVDS_N[5]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_P[5]}]
set_property IOSTANDARD LVDS [get_ports {FB3_TX_LVDS_N[5]}]
set_property PACKAGE_PIN J20 [get_ports FB3_TX_FWD_CLK_N]
set_property IOSTANDARD LVDS [get_ports FB3_TX_FWD_CLK_P]
set_property IOSTANDARD LVDS [get_ports FB3_TX_FWD_CLK_N]
set_property PACKAGE_PIN C20 [get_ports FB3_SOFT_RESET0_N]
set_property IOSTANDARD LVDS [get_ports FB3_SOFT_RESET0_P]
set_property IOSTANDARD LVDS [get_ports FB3_SOFT_RESET0_N]
set_property PACKAGE_PIN U21 [get_ports FB3_SOFT_RESET1_N]
set_property IOSTANDARD LVDS [get_ports FB3_SOFT_RESET1_P]
set_property IOSTANDARD LVDS [get_ports FB3_SOFT_RESET1_N]
set_property PACKAGE_PIN E13 [get_ports {FB4_TX_LVDS_N[0]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_P[0]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_N[0]}]
set_property PACKAGE_PIN B18 [get_ports {FB4_TX_LVDS_N[1]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_P[1]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_N[1]}]
set_property PACKAGE_PIN G12 [get_ports {FB4_TX_LVDS_N[2]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_P[2]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_N[2]}]
set_property PACKAGE_PIN K16 [get_ports {FB4_TX_LVDS_N[3]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_P[3]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_N[3]}]
set_property PACKAGE_PIN M16 [get_ports {FB4_TX_LVDS_N[4]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_P[4]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_N[4]}]
set_property PACKAGE_PIN T13 [get_ports {FB4_TX_LVDS_N[5]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_P[5]}]
set_property IOSTANDARD LVDS [get_ports {FB4_TX_LVDS_N[5]}]
set_property PACKAGE_PIN H17 [get_ports FB4_TX_FWD_CLK_N]
set_property IOSTANDARD LVDS [get_ports FB4_TX_FWD_CLK_P]
set_property IOSTANDARD LVDS [get_ports FB4_TX_FWD_CLK_N]
set_property PACKAGE_PIN C14 [get_ports FB4_SOFT_RESET0_N]
set_property IOSTANDARD LVDS [get_ports FB4_SOFT_RESET0_P]
set_property IOSTANDARD LVDS [get_ports FB4_SOFT_RESET0_N]
set_property PACKAGE_PIN K13 [get_ports FB4_SOFT_RESET1_N]
set_property IOSTANDARD LVDS [get_ports FB4_SOFT_RESET1_P]
set_property IOSTANDARD LVDS [get_ports FB4_SOFT_RESET1_N]


# physical constraint (pin location)

############################################################
############################################################
set_property PACKAGE_PIN AV15 [get_ports SYSCLK_N]

# GTREFCLK0_N_IN <left Q4_CLK0> 211
set_property PACKAGE_PIN AR36 [get_ports {GTREFCLK_N_IN[0]}]

# GTREFCLK1_N_IN <left Q4_CLK0> 214
set_property PACKAGE_PIN AA36 [get_ports {GTREFCLK_N_IN[1]}]

# GTREFCLK2_N_IN <left Q7_CLK0> 217
set_property PACKAGE_PIN J36 [get_ports {GTREFCLK_N_IN[2]}]

# GTREFCLK3_N_IN <right Q0_CLK0> 110
set_property PACKAGE_PIN AY7 [get_ports {GTREFCLK_N_IN[3]}]

# GTREFCLK4_N_IN <right Q0_CLK0> 112
set_property PACKAGE_PIN AL9 [get_ports {GTREFCLK_N_IN[4]}]

# GTREFCLK4_N_IN <right Q0_CLK0> 115
set_property PACKAGE_PIN U9 [get_ports {GTREFCLK_N_IN[5]}]


set_property PACKAGE_PIN E10 [get_ports ETH_GTREFCLK_P_IN]

# <SPI interface>
# set_property PACKAGE_PIN BC24 [get_ports MISO]
# set_property PACKAGE_PIN BC25 [get_ports MOSI]
# set_property PACKAGE_PIN BD26 [get_ports SPI_SEL]
# set_property PACKAGE_PIN AV23 [get_ports SCLK]
# set_property IOSTANDARD LVCMOS18 [get_ports MISO]
# set_property IOSTANDARD LVCMOS18 [get_ports MOSI]
# set_property IOSTANDARD LVCMOS18 [get_ports SPI_SEL]
# set_property IOSTANDARD LVCMOS18 [get_ports SCLK]


set_property PACKAGE_PIN BD35 [get_ports FB_SCL]
set_property PACKAGE_PIN BC34 [get_ports FB_SDA]

# slot1
set_property LOC GTHE2_CHANNEL_X1Y33 [get_cells MY_USER_INTERFACE/eth/phy/U0/transceiver_inst/gtwizard_inst/U0/gtwizard_i/gt0_GTWIZARD_i/gthe2_i]
# slot2
#set_property LOC GTHE2_CHANNEL_X1Y28 [get_cells MY_USER_INTERFACE/eth/phy/U0/transceiver_inst/gtwizard_inst/U0/gtwizard_i/gt0_GTWIZARD_i/gthe2_i]

set_property PACKAGE_PIN AJ30 [get_ports LED0]
set_property PACKAGE_PIN AK33 [get_ports LED1]
set_property PACKAGE_PIN AJ32 [get_ports LED2]
set_property PACKAGE_PIN AJ31 [get_ports LED3]

# physical constraint (iostandard)

set_property IOSTANDARD LVDS [get_ports SYSCLK_P]
set_property IOSTANDARD LVDS [get_ports SYSCLK_N]
set_property DIFF_TERM TRUE [get_ports SYSCLK_P]
set_property DIFF_TERM TRUE [get_ports SYSCLK_N]

set_property IOSTANDARD LVCMOS18 [get_ports FB_SCL]
set_property IOSTANDARD LVCMOS18 [get_ports FB_SDA]

set_property IOSTANDARD LVCMOS18 [get_ports LED0]
set_property IOSTANDARD LVCMOS18 [get_ports LED1]
set_property IOSTANDARD LVCMOS18 [get_ports LED2]
set_property IOSTANDARD LVCMOS18 [get_ports LED3]

# physical constraint (gt slice location)
# RTM LEFT
set_property LOC GTHE2_CHANNEL_X0Y0 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt0_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y1 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt1_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y2 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt2_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y3 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt3_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y4 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt4_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y5 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt5_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y6 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt6_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y7 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt7_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y8 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt8_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y9 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt9_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y10 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt10_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y11 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt11_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y12 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt12_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y13 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt13_gt64_rtm34l_i/gthe2_i]
## set_property LOC GTHE2_CHANNEL_X0Y14 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt14_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y15 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt15_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y16 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt16_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y17 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt17_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y18 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt18_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y19 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt19_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y20 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt20_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y21 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt21_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y22 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt22_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y23 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt23_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y24 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt24_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y25 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt25_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y26 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt26_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y27 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt27_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y28 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt28_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y29 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt29_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y30 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt30_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y31 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt31_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y32 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt32_gt64_rtm34l_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X0Y33 [get_cells my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt33_gt64_rtm34l_i/gthe2_i]

set_property LOC GTHE2_CHANNEL_X1Y8 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt0_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y9 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt1_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y10 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt2_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y11 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt3_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y12 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt4_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y13 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt5_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y14 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt6_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y15 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt7_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y16 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt8_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y17 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt9_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y18 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt10_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y19 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt11_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y20 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt12_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y21 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt13_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y22 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt14_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y23 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt15_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y24 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt16_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y25 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt17_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y26 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt18_gt625_fab20_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y27 [get_cells my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt19_gt625_fab20_i/gthe2_i]

# RTM RIGHT
set_property LOC GTHE2_CHANNEL_X1Y0 [get_cells my_df_transceiver/my_gt_rtm6r_interface/gt64_rtm6r_support_i/gt64_rtm6r_init_i/U0/gt64_rtm6r_i/gt0_gt64_rtm6r_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y1 [get_cells my_df_transceiver/my_gt_rtm6r_interface/gt64_rtm6r_support_i/gt64_rtm6r_init_i/U0/gt64_rtm6r_i/gt1_gt64_rtm6r_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y2 [get_cells my_df_transceiver/my_gt_rtm6r_interface/gt64_rtm6r_support_i/gt64_rtm6r_init_i/U0/gt64_rtm6r_i/gt2_gt64_rtm6r_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y3 [get_cells my_df_transceiver/my_gt_rtm6r_interface/gt64_rtm6r_support_i/gt64_rtm6r_init_i/U0/gt64_rtm6r_i/gt3_gt64_rtm6r_i/gthe2_i]
set_property LOC GTHE2_CHANNEL_X1Y4 [get_cells my_df_transceiver/my_gt_rtm6r_interface/gt64_rtm6r_support_i/gt64_rtm6r_init_i/U0/gt64_rtm6r_i/gt4_gt64_rtm6r_i/gthe2_i]
## set_property LOC GTHE2_CHANNEL_X1Y5 [get_cells my_df_transceiver/my_gt_rtm6r_interface/gt64_rtm6r_support_i/gt64_rtm6r_init_i/U0/gt64_rtm6r_i/gt5_gt64_rtm6r_i/gthe2_i]

############################################################
############################################################
create_clock -period 5.000 -name sys_clk -waveform {0.000 2.500} [get_ports SYSCLK_P]
create_clock -period 5.000 -name refclk0_i -waveform {0.000 2.500} [get_ports {GTREFCLK_P_IN[0]}]
create_clock -period 5.000 -name refclk1_i -waveform {0.000 2.500} [get_ports {GTREFCLK_P_IN[1]}]
create_clock -period 5.000 -name refclk2_i -waveform {0.000 2.500} [get_ports {GTREFCLK_P_IN[2]}]
create_clock -period 5.000 -name refclk3_i -waveform {0.000 2.500} [get_ports {GTREFCLK_P_IN[3]}]
create_clock -period 8.000 -name refclk2_i -waveform {0.000 4.000} [get_ports {GTREFCLK_P_IN[4]}]
create_clock -period 8.000 -name refclk3_i -waveform {0.000 4.000} [get_ports {GTREFCLK_P_IN[5]}]


## 5.7143 {0 2.8571} is for 175MHz
# create_clock -name main_clk_i  -period 5.7143  -waveform {0 2.8571}   [get_pins CLKBUFFER/U0/mmcm_adv_inst/CLKOUT1]
## 5 {0 2.5} is for 200 MHz
# create_clock -name main_clk_i        -period 5  -waveform {0 2.5}      [get_pins CLKBUFFER/U0/mmcm_adv_inst/CLKOUT1]
## 6.667 {0 3.333} is for 150 MHz
# create_clock -name main_clk_i        -period 6.667  -waveform {0 3.333}      [get_pins CLKBUFFER/U0/mmcm_adv_inst/CLKOUT1]
## 10.000 {0 5.000} is for 100 MHz
# create_clock -name main_clk_i        -period 10 -waveform {0 5.0}      [get_pins CLKBUFFER/U0/mmcm_adv_inst/CLKOUT1]
## 8.000 {0 4.000} is for 125 MHz

create_clock -period 5.000 -name fmc_common_clk_i -waveform {0.000 2.500} [get_pins CLKBUFFER/U0/mmcm_adv_inst/CLKOUT0]
create_clock -period 8.000 -name main_clk_i -waveform {0.000 4.000} [get_pins CLKBUFFER/U0/mmcm_adv_inst/CLKOUT1]
create_clock -period 20.000 -name clk50_i -waveform {0.000 10.000} [get_pins CLKBUFFER/U0/mmcm_adv_inst/CLKOUT2]
#create_clock -name main_clk_i  -period 6.6667 -waveform {0 3.3333} [get_pins CLKBUFFER/U0/mmcm_adv_inst/CLKOUT3]

create_clock -period 6.250 -name gt64_rtm34l_userclk0_i -waveform {0.000 3.125} [get_pins my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt0_gt64_rtm34l_i/gthe2_i/TXOUTCLK]
create_clock -period 6.250 -name gt64_rtm34l_userclk12_i -waveform {0.000 3.125} [get_pins my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt12_gt64_rtm34l_i/gthe2_i/TXOUTCLK]
create_clock -period 6.250 -name gt64_rtm34l_userclk24_i -waveform {0.000 3.125} [get_pins my_df_transceiver/my_gt_rtm34l_interface/gt64_rtm34l_support_i/gt64_rtm34l_init_i/U0/gt64_rtm34l_i/gt24_gt64_rtm34l_i/gthe2_i/TXOUTCLK]
create_clock -period 6.250 -name gt64_rtm6r_userclk0_i -waveform {0.000 3.125} [get_pins my_df_transceiver/my_gt_rtm6r_interface/gt64_rtm6r_support_i/gt64_rtm6r_init_i/U0/gt64_rtm6r_i/gt0_gt64_rtm6r_i/gthe2_i/TXOUTCLK]
create_clock -period 6.400 -name gt625_fab20_userclk0_i -waveform {0.000 3.200} [get_pins my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt0_gt625_fab20_i/gthe2_i/TXOUTCLK]
create_clock -period 6.400 -name gt625_fab20_userclk8_i -waveform {0.000 3.200} [get_pins my_df_transceiver/my_gt_fab20_interface/gt625_fab20_support_i/gt625_fab20_init_i/U0/gt625_fab20_i/gt8_gt625_fab20_i/gthe2_i/TXOUTCLK]

create_clock -period 5.000 -name f1clk0_i -waveform {0.000 2.500} [get_ports FB1_CLK0_P]
create_clock -period 5.000 -name f1clk1_i -waveform {0.000 2.500} [get_ports FB1_CLK1_P]
create_clock -period 5.000 -name f2clk0_i -waveform {0.000 2.500} [get_ports FB2_CLK0_P]
create_clock -period 5.000 -name f2clk1_i -waveform {0.000 2.500} [get_ports FB2_CLK1_P]
create_clock -period 5.000 -name f3clk0_i -waveform {0.000 2.500} [get_ports FB3_CLK0_P]
create_clock -period 5.000 -name f3clk1_i -waveform {0.000 2.500} [get_ports FB3_CLK1_P]
create_clock -period 5.000 -name f4clk0_i -waveform {0.000 2.500} [get_ports FB4_CLK0_P]
create_clock -period 5.000 -name f4clk1_i -waveform {0.000 2.500} [get_ports FB4_CLK1_P]

create_clock -period 16.000 -name eth_txoutclk -waveform {0.000 8.000} [get_pins MY_USER_INTERFACE/eth/phy/U0/transceiver_inst/gtwizard_inst/U0/gtwizard_i/gt0_GTWIZARD_i/gthe2_i/TXOUTCLK]
create_clock -period 16.000 -name eth_rxoutclk -waveform {0.000 8.000} [get_pins MY_USER_INTERFACE/eth/phy/U0/transceiver_inst/gtwizard_inst/U0/gtwizard_i/gt0_GTWIZARD_i/gthe2_i/RXOUTCLK]
create_clock -period 8.000 -name clk125_fr -waveform {0.000 4.000} [get_pins MY_USER_INTERFACE/eth/bufg_fr/O]
create_clock -period 8.000 -name clk125 -waveform {0.000 4.000} [get_pins MY_USER_INTERFACE/eth/bufg_125/O]
create_clock -period 16.000 -name CLKFBIN -waveform {0.000 8.000} [get_pins MY_USER_INTERFACE/eth/mcmm/CLKFBOUT]
create_clock -period 16.000 -name n_4_mcmm -waveform {0.000 8.000} [get_pins MY_USER_INTERFACE/eth/mcmm/CLKOUT1]
create_clock -period 8.000 -name n_6_mcmm -waveform {0.000 4.000} [get_pins MY_USER_INTERFACE/eth/mcmm/CLKOUT2]
create_clock -period 32.000 -name n_8_mcmm -waveform {0.000 16.000} [get_pins MY_USER_INTERFACE/eth/mcmm/CLKOUT3]
create_clock -period 8.000 -name CLKFBIN_1 -waveform {0.000 4.000} [get_pins MY_USER_INTERFACE/clocks/mmcm/CLKFBOUT]
create_clock -period 32.000 -name CLKOUT1 -waveform {0.000 16.000} [get_pins MY_USER_INTERFACE/clocks/mmcm/CLKOUT1]

#create_generated_clock -name iclk2_1_i -source [get_pins SLINK_INTERFACE/GT_INTERFACE/pulsariia_gtx_for_ros_2gbps_link_2lanes_support_i/U0/pulsariia_gtx_for_ros_2gbps_link_2lanes_init_i/pulsariia_gtx_for_ros_2gbps_link_2lanes_i/gt0_pulsariia_gtx_for_ros_2gbps_link_2lanes_i/gtxe2_i/TXOUTCLK] -divide_by 2 [get_pins SLINK_INTERFACE/L0_LSC/MyLSC/ICLK2_G.ICLK_2_reg/Q ]
#create_generated_clock -name iclk2_2_i -source [get_pins SLINK_INTERFACE/GT_INTERFACE/pulsariia_gtx_for_ros_2gbps_link_2lanes_support_i/U0/pulsariia_gtx_for_ros_2gbps_link_2lanes_init_i/pulsariia_gtx_for_ros_2gbps_link_2lanes_i/gt0_pulsariia_gtx_for_ros_2gbps_link_2lanes_i/gtxe2_i/TXOUTCLK] -divide_by 2 [get_pins SLINK_INTERFACE/L1_LSC/MyLSC/ICLK2_G.ICLK_2_reg/Q ]
#create_clock -name i2c1clk_i -period 1000 -waveform {0 500} [get_pins SPI_INTERFACE/i2c_master_fb1/data_clk_reg/Q ]
#create_clock -name i2c2clk_i -period 1000 -waveform {0 500} [get_pins SPI_INTERFACE/i2c_master_fb2/data_clk_reg/Q ]

set_false_path -from [get_clocks main_clk_i] -to [get_clocks fmc_common_clk_i]
set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks main_clk_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks fmc_common_clk_i]
set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks f1clk0_i]
set_false_path -from [get_clocks f1clk0_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks f1clk1_i]
set_false_path -from [get_clocks f1clk1_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks f2clk0_i]
set_false_path -from [get_clocks f2clk0_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks f2clk1_i]
set_false_path -from [get_clocks f2clk1_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks f3clk0_i]
set_false_path -from [get_clocks f3clk0_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks f3clk1_i]
set_false_path -from [get_clocks f3clk1_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks f4clk0_i]
set_false_path -from [get_clocks f4clk0_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks f4clk1_i]
set_false_path -from [get_clocks f4clk1_i] -to [get_clocks clk50_i]

#set_false_path -from [get_clocks "clk50_i"] -to [get_clocks "i2c1clk_i"]
#set_false_path -from [get_clocks "i2c1clk_i"] -to [get_clocks "clk50_i"]

#set_false_path -from [get_clocks "clk50_i"] -to [get_clocks "i2c2clk_i"]
#set_false_path -from [get_clocks "i2c2clk_i"] -to [get_clocks "clk50_i"]

#set_false_path -from [get_clocks "main_clk_i"] -to [get_clocks "i2c1clk_i"]
#set_false_path -from [get_clocks "i2c1clk_i"] -to [get_clocks "main_clk_i"]

#set_false_path -from [get_clocks "main_clk_i"] -to [get_clocks "i2c2clk_i"]
#set_false_path -from [get_clocks "i2c2clk_i"] -to [get_clocks "main_clk_i"]

#set_false_path -from [get_clocks "iclk2_2_i"] -to [get_clocks "main_clk_i"]
#set_false_path -from [get_clocks "main_clk_i"] -to [get_clocks "iclk2_2_i"]

#set_false_path -from [get_clocks "iclk2_1_i"] -to [get_clocks "main_clk_i"]
#set_false_path -from [get_clocks "main_clk_i"] -to [get_clocks "iclk2_1_i"]

##
set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks f1clk0_i]
set_false_path -from [get_clocks f1clk0_i] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks f1clk1_i]
set_false_path -from [get_clocks f1clk1_i] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks f2clk0_i]
set_false_path -from [get_clocks f2clk0_i] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks f2clk1_i]
set_false_path -from [get_clocks f2clk1_i] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks f3clk0_i]
set_false_path -from [get_clocks f3clk0_i] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks f3clk1_i]
set_false_path -from [get_clocks f3clk1_i] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks f4clk0_i]
set_false_path -from [get_clocks f4clk0_i] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks f4clk1_i]
set_false_path -from [get_clocks f4clk1_i] -to [get_clocks fmc_common_clk_i]


#######################################################################################

set_false_path -from [get_clocks clk125_fr] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks clk125_fr]
set_false_path -from [get_clocks clk125_fr] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks clk125_fr]
set_false_path -from [get_clocks clk125_fr] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks clk125_fr]
set_false_path -from [get_clocks clk125_fr] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks sys_clk] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks sys_clk]

set_false_path -from [get_clocks sys_clk] -to [get_clocks clk125_fr]
set_false_path -from [get_clocks clk125_fr] -to [get_clocks sys_clk]

set_false_path -from [get_clocks sys_clk] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks sys_clk]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks clk125] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks clk125]

set_false_path -from [get_clocks sys_clk] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks sys_clk]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks sys_clk] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks sys_clk]

set_false_path -from [get_clocks sys_clk] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks sys_clk]

set_false_path -from [get_clocks clk125] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks clk125]

set_false_path -from [get_clocks clk125] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks clk125]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks sys_clk]
set_false_path -from [get_clocks sys_clk] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks sys_clk]
set_false_path -from [get_clocks sys_clk] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks sys_clk]
set_false_path -from [get_clocks sys_clk] -to [get_clocks n_8_mcmm]
###############


set_false_path -from [get_clocks clk125_fr] -to [get_clocks fmc_common_clk_i]
set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks fmc_common_clk_i]
set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks fmc_common_clk_i]
set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks fmc_common_clk_i]
set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks sys_clk] -to [get_clocks fmc_common_clk_i]
set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks sys_clk]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks fmc_common_clk_i]

set_false_path -from [get_clocks fmc_common_clk_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks fmc_common_clk_i]
###############

set_false_path -from [get_clocks clk125_fr] -to [get_clocks clk50_i]
set_false_path -from [get_clocks clk50_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks clk50_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks clk50_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks clk50_i]
set_false_path -from [get_clocks clk50_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks clk50_i]
set_false_path -from [get_clocks clk50_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks clk50_i]
set_false_path -from [get_clocks clk50_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks sys_clk] -to [get_clocks clk50_i]
set_false_path -from [get_clocks clk50_i] -to [get_clocks sys_clk]

set_false_path -from [get_clocks clk50_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks clk50_i]
###############

set_false_path -from [get_clocks clk125_fr] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks main_clk_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks main_clk_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks main_clk_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks main_clk_i]

set_false_path -from [get_clocks main_clk_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks main_clk_i]

set_false_path -from [get_clocks main_clk_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks main_clk_i]

###############
set_false_path -from [get_clocks clk50_i] -to [get_clocks gt64_rtm34l_userclk0_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks gt64_rtm34l_userclk0_i]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks gt64_rtm34l_userclk0_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks gt64_rtm34l_userclk0_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks gt64_rtm34l_userclk0_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks gt64_rtm34l_userclk0_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks gt64_rtm34l_userclk0_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks gt64_rtm34l_userclk0_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks gt64_rtm34l_userclk0_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk0_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks gt64_rtm34l_userclk0_i]
###############

set_false_path -from [get_clocks clk50_i] -to [get_clocks gt64_rtm34l_userclk12_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks gt64_rtm34l_userclk12_i]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks gt64_rtm34l_userclk12_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks gt64_rtm34l_userclk12_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks gt64_rtm34l_userclk12_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks gt64_rtm34l_userclk12_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks gt64_rtm34l_userclk12_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks gt64_rtm34l_userclk12_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks gt64_rtm34l_userclk12_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk12_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks gt64_rtm34l_userclk12_i]
###############

set_false_path -from [get_clocks clk50_i] -to [get_clocks gt64_rtm34l_userclk24_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks gt64_rtm34l_userclk24_i]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks gt64_rtm34l_userclk24_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks gt64_rtm34l_userclk24_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks gt64_rtm34l_userclk24_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks gt64_rtm34l_userclk24_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks gt64_rtm34l_userclk24_i]
set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks gt64_rtm34l_userclk24_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks gt64_rtm34l_userclk24_i]

set_false_path -from [get_clocks gt64_rtm34l_userclk24_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks gt64_rtm34l_userclk24_i]
###############

set_false_path -from [get_clocks clk50_i] -to [get_clocks gt64_rtm6r_userclk0_i]
set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks gt64_rtm6r_userclk0_i]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks gt64_rtm6r_userclk0_i]
set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks gt64_rtm6r_userclk0_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks gt64_rtm6r_userclk0_i]
set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks gt64_rtm6r_userclk0_i]
set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks gt64_rtm6r_userclk0_i]
set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks gt64_rtm6r_userclk0_i]

set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks gt64_rtm6r_userclk0_i]

set_false_path -from [get_clocks gt64_rtm6r_userclk0_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks gt64_rtm6r_userclk0_i]
###############


set_false_path -from [get_clocks clk50_i] -to [get_clocks gt625_fab20_userclk0_i]
set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks gt625_fab20_userclk0_i]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks gt625_fab20_userclk0_i]
set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks gt625_fab20_userclk0_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks gt625_fab20_userclk0_i]
set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks gt625_fab20_userclk0_i]
set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks gt625_fab20_userclk0_i]
set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks gt625_fab20_userclk0_i]

set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks gt625_fab20_userclk0_i]

set_false_path -from [get_clocks gt625_fab20_userclk0_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks gt625_fab20_userclk0_i]
###############

set_false_path -from [get_clocks clk50_i] -to [get_clocks gt625_fab20_userclk8_i]
set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks main_clk_i]
set_false_path -from [get_clocks main_clk_i] -to [get_clocks gt625_fab20_userclk8_i]

set_false_path -from [get_clocks clk125_fr] -to [get_clocks gt625_fab20_userclk8_i]
set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks gt625_fab20_userclk8_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks gt625_fab20_userclk8_i]
set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks gt625_fab20_userclk8_i]
set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks gt625_fab20_userclk8_i]
set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks gt625_fab20_userclk8_i]

set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks gt625_fab20_userclk8_i]

set_false_path -from [get_clocks gt625_fab20_userclk8_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks gt625_fab20_userclk8_i]
###############


set_false_path -from [get_clocks clk125_fr] -to [get_clocks f1clk1_i]
set_false_path -from [get_clocks f1clk1_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks f1clk1_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks f1clk1_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks f1clk1_i]
set_false_path -from [get_clocks f1clk1_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks f1clk1_i]
set_false_path -from [get_clocks f1clk1_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks f1clk1_i]
set_false_path -from [get_clocks f1clk1_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks f1clk1_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks f1clk1_i]

set_false_path -from [get_clocks f1clk1_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks f1clk1_i]

set_false_path -from [get_clocks f1clk1_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks f1clk1_i]
###############


set_false_path -from [get_clocks clk125_fr] -to [get_clocks f2clk1_i]
set_false_path -from [get_clocks f2clk1_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks f2clk1_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks f2clk1_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks f2clk1_i]
set_false_path -from [get_clocks f2clk1_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks f2clk1_i]
set_false_path -from [get_clocks f2clk1_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks f2clk1_i]
set_false_path -from [get_clocks f2clk1_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks f2clk1_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks f2clk1_i]

set_false_path -from [get_clocks f2clk1_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks f2clk1_i]

set_false_path -from [get_clocks f2clk1_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks f2clk1_i]
###############



set_false_path -from [get_clocks clk125_fr] -to [get_clocks f3clk1_i]
set_false_path -from [get_clocks f3clk1_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks f3clk1_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks f3clk1_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks f3clk1_i]
set_false_path -from [get_clocks f3clk1_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks f3clk1_i]
set_false_path -from [get_clocks f3clk1_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks f3clk1_i]
set_false_path -from [get_clocks f3clk1_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks f3clk1_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks f3clk1_i]

set_false_path -from [get_clocks f3clk1_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks f3clk1_i]

set_false_path -from [get_clocks f3clk1_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks f3clk1_i]
###############


set_false_path -from [get_clocks clk125_fr] -to [get_clocks f4clk1_i]
set_false_path -from [get_clocks f4clk1_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks f4clk1_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks f4clk1_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks f4clk1_i]
set_false_path -from [get_clocks f4clk1_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks f4clk1_i]
set_false_path -from [get_clocks f4clk1_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks f4clk1_i]
set_false_path -from [get_clocks f4clk1_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks f4clk1_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks f4clk1_i]

set_false_path -from [get_clocks f4clk1_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks f4clk1_i]

set_false_path -from [get_clocks f4clk1_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks f4clk1_i]
###############


set_false_path -from [get_clocks clk125_fr] -to [get_clocks f1clk0_i]
set_false_path -from [get_clocks f1clk0_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks f1clk0_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks f1clk0_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks f1clk0_i]
set_false_path -from [get_clocks f1clk0_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks f1clk0_i]
set_false_path -from [get_clocks f1clk0_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks f1clk0_i]
set_false_path -from [get_clocks f1clk0_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks f1clk0_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks f1clk0_i]

set_false_path -from [get_clocks f1clk0_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks f1clk0_i]

set_false_path -from [get_clocks f1clk0_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks f1clk0_i]
###############


set_false_path -from [get_clocks clk125_fr] -to [get_clocks f2clk0_i]
set_false_path -from [get_clocks f2clk0_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks f2clk0_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks f2clk0_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks f2clk0_i]
set_false_path -from [get_clocks f2clk0_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks f2clk0_i]
set_false_path -from [get_clocks f2clk0_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks f2clk0_i]
set_false_path -from [get_clocks f2clk0_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks f2clk0_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks f2clk0_i]

set_false_path -from [get_clocks f2clk0_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks f2clk0_i]

set_false_path -from [get_clocks f2clk0_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks f2clk0_i]
###############



set_false_path -from [get_clocks clk125_fr] -to [get_clocks f3clk0_i]
set_false_path -from [get_clocks f3clk0_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks f3clk0_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks f3clk0_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks f3clk0_i]
set_false_path -from [get_clocks f3clk0_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks f3clk0_i]
set_false_path -from [get_clocks f3clk0_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks f3clk0_i]
set_false_path -from [get_clocks f3clk0_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks f3clk0_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks f3clk0_i]

set_false_path -from [get_clocks f3clk0_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks f3clk0_i]

set_false_path -from [get_clocks f3clk0_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks f3clk0_i]
###############


set_false_path -from [get_clocks clk125_fr] -to [get_clocks f4clk0_i]
set_false_path -from [get_clocks f4clk0_i] -to [get_clocks clk125_fr]

set_false_path -from [get_clocks f4clk0_i] -to [get_clocks clk125]
set_false_path -from [get_clocks clk125] -to [get_clocks f4clk0_i]

set_false_path -from [get_clocks n_4_mcmm] -to [get_clocks f4clk0_i]
set_false_path -from [get_clocks f4clk0_i] -to [get_clocks n_4_mcmm]

set_false_path -from [get_clocks n_6_mcmm] -to [get_clocks f4clk0_i]
set_false_path -from [get_clocks f4clk0_i] -to [get_clocks n_6_mcmm]

set_false_path -from [get_clocks n_8_mcmm] -to [get_clocks f4clk0_i]
set_false_path -from [get_clocks f4clk0_i] -to [get_clocks n_8_mcmm]

set_false_path -from [get_clocks f4clk0_i] -to [get_clocks CLKOUT1]
set_false_path -from [get_clocks CLKOUT1] -to [get_clocks f4clk0_i]

set_false_path -from [get_clocks f4clk0_i] -to [get_clocks eth_txoutclk]
set_false_path -from [get_clocks eth_txoutclk] -to [get_clocks f4clk0_i]

set_false_path -from [get_clocks f4clk0_i] -to [get_clocks eth_rxoutclk]
set_false_path -from [get_clocks eth_rxoutclk] -to [get_clocks f4clk0_i]


### Nina added to avoid timing violations during synthesis

set_false_path -from [get_clocks clk50_i] -to [get_clocks refclk0_i]
set_false_path -from [get_clocks refclk0_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks refclk1_i]
set_false_path -from [get_clocks refclk1_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks refclk2_i]
set_false_path -from [get_clocks refclk2_i] -to [get_clocks clk50_i]

set_false_path -from [get_clocks clk50_i] -to [get_clocks refclk3_i]
set_false_path -from [get_clocks refclk3_i] -to [get_clocks clk50_i]


###############
